notes/meeting_2021nov07.org
* meeting notes November 07, 2021                                      
** the raku study group
*** (Don't you raku the u-boat, you)
** the usual links:
*** meeting notes
**** https://github.com/doomvox/raku-study/blob/main/notes/meeting_2021nov07.md
*** code examples:
**** https://github.com/doomvox/raku-study/tree/main/bin/2021nov07

** plan of attack (retreat?)
*** open the floor to topics
*** the state of the left-hand junction smart match
**** the endearing cultural quirks of the raku community

*** roll your own associative
**** https://www.reddit.com/r/rakulang/comments/pocomd/a_post_which_came_out_from_a_provocation/hczsrw0/?context=3

*** may start using spots as data for demos
**** /home/doom/End/Cave/Spots/Output/Nyrlathotep/spots_schema.png
**** to replicate what I do, you'd need to do this:
***** initialize db using: https://github.com/doomvox/spots/blob/main/bin/spots_schema.sql


*** david christensen on using cpp with perl code to do includes
**** Filter::cpp
**** https://stackoverflow.com/questions/2009526/are-comments-always-processed-before-the-preprocessor 

*** bruce gray on the weekly challenge:
**** https://theweeklychallenge.org/blog/perl-weekly-challenge-137/#TASK1
**** https://theweeklychallenge.org/blog/perl-weekly-challenge-137/#TASK2
**** https://github.com/Util/perlweeklychallenge-club/blob/branch-for-challenge-137/challenge-137/bruce-gray/raku/ch-1.raku
**** https://github.com/Util/perlweeklychallenge-club/blob/branch-for-challenge-137/challenge-137/bruce-gray/raku/ch-2.raku 

*** Bill's oneliners:
**** https://unix.stackexchange.com/a/676476/227738
**** https://unix.stackexchange.com/a/676180/227738
**** https://unix.stackexchange.com/a/675961/227738
**** https://unix.stackexchange.com/a/675674/227738
**** https://unix.stackexchange.com/a/675581/227738
**** https://unix.stackexchange.com/a/675007/227738
**** https://unix.stackexchange.com/a/674571/227738
**** https://unix.stackexchange.com/a/674566/227738


** announcements
*** the ephemeral miniconf: nov 18 2021
**** https://dev.to/thibaultduponchelle/the-ephemeral-miniconf-292j
** next meeting
*** next meeting: Nov 14, 2021
