notes/meeting_2021nov07.md
- [meeting notes November 07, 2021](#orge06ea09)
  - [the raku study group](#org037ae95)
    - [(Don't you raku the u-boat, you)](#org1716dd5)
  - [the usual links:](#org640ab13)
    - [meeting notes](#org506143d)
    - [code examples:](#org013cd66)
  - [plan of attack (retreat?)](#org2f182bf)
    - [open the floor to topics](#org8db5a92)
    - [the state of the left-hand junction smart match](#orge39537b)
    - [roll your own associative](#org0677759)
    - [may start using spots as data for demos](#org184ea2d)
    - [david christensen on using cpp with perl code to do includes](#orge72cf80)
    - [bruce gray on the weekly challenge:](#org577f857)
    - [Bill's oneliners:](#orgac2e441)
  - [announcements](#org6625ab7)
    - [the ephemeral miniconf: nov 18 2021](#orgfe74b03)
  - [next meeting](#org4f00691)
    - [next meeting: Nov 14, 2021](#orga6bdab5)


<a id="orge06ea09"></a>

# meeting notes November 07, 2021


<a id="org037ae95"></a>

## the raku study group


<a id="org1716dd5"></a>

### (Don't you raku the u-boat, you)


<a id="org640ab13"></a>

## the usual links:


<a id="org506143d"></a>

### meeting notes

1.  <https://github.com/doomvox/raku-study/blob/main/notes/meeting_2021nov07.md>


<a id="org013cd66"></a>

### code examples:

1.  <https://github.com/doomvox/raku-study/tree/main/bin/2021nov07>


<a id="org2f182bf"></a>

## plan of attack (retreat?)


<a id="org8db5a92"></a>

### open the floor to topics


<a id="orge39537b"></a>

### the state of the left-hand junction smart match

1.  the endearing cultural quirks of the raku community


<a id="org0677759"></a>

### roll your own associative

1.  <https://www.reddit.com/r/rakulang/comments/pocomd/a_post_which_came_out_from_a_provocation/hczsrw0/?context=3>


<a id="org184ea2d"></a>

### may start using spots as data for demos

1.  /home/doom/End/Cave/Spots/Output/Nyrlathotep/spots<sub>schema.png</sub>

2.  to replicate what I do, you'd need to do this:

    1.  initialize db using: <https://github.com/doomvox/spots/blob/main/bin/spots_schema.sql>


<a id="orge72cf80"></a>

### david christensen on using cpp with perl code to do includes

1.  Filter::cpp

2.  <https://stackoverflow.com/questions/2009526/are-comments-always-processed-before-the-preprocessor>


<a id="org577f857"></a>

### bruce gray on the weekly challenge:

1.  <https://theweeklychallenge.org/blog/perl-weekly-challenge-137/#TASK1>

2.  <https://theweeklychallenge.org/blog/perl-weekly-challenge-137/#TASK2>

3.  <https://github.com/Util/perlweeklychallenge-club/blob/branch-for-challenge-137/challenge-137/bruce-gray/raku/ch-1.raku>

4.  <https://github.com/Util/perlweeklychallenge-club/blob/branch-for-challenge-137/challenge-137/bruce-gray/raku/ch-2.raku>


<a id="orgac2e441"></a>

### Bill's oneliners:

1.  <https://unix.stackexchange.com/a/676476/227738>

2.  <https://unix.stackexchange.com/a/676180/227738>

3.  <https://unix.stackexchange.com/a/675961/227738>

4.  <https://unix.stackexchange.com/a/675674/227738>

5.  <https://unix.stackexchange.com/a/675581/227738>

6.  <https://unix.stackexchange.com/a/675007/227738>

7.  <https://unix.stackexchange.com/a/674571/227738>

8.  <https://unix.stackexchange.com/a/674566/227738>


<a id="org6625ab7"></a>

## announcements


<a id="orgfe74b03"></a>

### the ephemeral miniconf: nov 18 2021

1.  <https://dev.to/thibaultduponchelle/the-ephemeral-miniconf-292j>


<a id="org4f00691"></a>

## next meeting


<a id="orga6bdab5"></a>

### next meeting: Nov 14, 2021
